# To load dummy data
- 카톡방에 올린 csv 파일 확인

In [ ]:
import pandas as pd
data = pd.read_csv('parking_6m_edit.csv')

locations = list(data.columns)[1:]
cols = ['ts'] + locations
data.columns = cols
data.head()

                    ts       A1       A2       A3       B1       B2       B3
0  2021-01-01 00:00:00  98소4353  09고9301  05라0978  99다9169      NaN  14허9325
1  2021-01-01 00:30:00  98소4353  09고9301  05라0978  99다9169  10두5133  14허9325
2  2021-01-01 01:00:00  98소4353  59어1034  05라0978  99다9169      NaN  14허9325
3  2021-01-01 01:30:00  98소4353  59어1034      NaN  99다9169  05라0978  14허9325
4  2021-01-01 02:00:00  98소4353  23모3098  37로0265  99다9169  05라0978  14허9325

# Processing duplicated plate number

In [ ]:
car_list = []
for location in locations:
  car_list += list(data[location].dropna().unique())

car_set = set(car_list)
car_list = list(car_set)

## Total plate number

In [ ]:
car_list

['18로5146',
 '16조6670',
 '37로0265',
 '12버6916',
 '03마0518',
 '82로4935',
 '42조1354',
 '46러4751',
 '09고9301',
 '07너1838',
 '59어1034',
 '91노6193',
 '87더3315',
 '10두5133',
 '38어4657',
 '05라0978',
 '73마7810',
 '80거3267',
 '69수8480',
 '23모3098',
 '15조9407',
 '64수4687',
 '91거7182',
 '82라8121',
 '28하0957',
 '27호4980',
 '27버4896',
 '34주3829',
 '38나8386',
 '99다9169',
 '97노7631',
 '98소4353',
 '38부2624',
 '84너2411',
 '13너6475',
 '81누1849',
 '28노2764',
 '14허9325',
 '88도9696',
 '27가4828',
 '76수2423',
 '83소0305',
 '64마3953',
 '10로3321',
 '81무0013',
 '42저5116',
 '73두0260',
 '25조3419',
 '53러8710',
 '01구4303']

## Residents plate number

In [ ]:
residents = ['38어4657',
 '38부2624',
 '42저5116',
 '27호4980',
 '07너1838',
 '28노2764',
 '37로0265',
 '05라0978',
 '87더3315',
 '91노6193',
 '46러4751',
 '34주3829',
 '91거7182',
 '73마7810',
 '82라8121',
 '80거3267',
 '28하0957',
 '69수8480',
 '64수4687',
 '14허9325',
 '15조9407',
 '97노7631',
 '03마0518', 
 '18로5146',
 '12버6916',
 '10로3321',
 '76수2423',
 '98소4353',
 '64마3953',
 '88도9696',
 '83소0305',
 '27버4896',
 '13너6475',
 '38나8386',
 '42조1354',
 '27가4828',
 '01구4303',
 '59어1034',
 '81누1849',
 '16조6670']

In [ ]:
len(residents)

40

# Counting accumulation of parking data by user and section

In [ ]:
import pandas as pd
from pandas import DataFrame

df = DataFrame(columns = locations, index=residents)
df.fillna(0, inplace=True)
df.head()

         A1  A2  A3  B1  B2  B3
38어4657   0   0   0   0   0   0
38부2624   0   0   0   0   0   0
42저5116   0   0   0   0   0   0
27호4980   0   0   0   0   0   0
07너1838   0   0   0   0   0   0

In [ ]:
for location in locations:
  temp_dict = data[location].value_counts().to_dict()
  for key in temp_dict.keys():
    if key in residents:
      df.loc[key, location] = temp_dict[key]
  
df.head()

          A1   A2   A3   B1   B2   B3
38어4657  103  104   67   75   64   81
38부2624   94   88   74  105   74   69
42저5116  108   87   84   91   81  117
27호4980   92   73  110  102  116  112
07너1838   60  137   83   93   68   91

## The largest zone for residents

In [ ]:
cols = ['1st', '2nd', '3rd']

popular = df.apply(lambda x: pd.Series(x.nlargest(3).index, index=cols), axis=1)
popular.head()

        1st 2nd 3rd
38어4657  A2  A1  B3
38부2624  B1  A1  A2
42저5116  B3  A1  B1
27호4980  B2  B3  A3
07너1838  A2  B1  B3